String getCvaMessage(double cva) {
  if (cva >= 47 && cva <= 50) {
    return "ค่า CVA จัดว่าเป็นผู้ที่มีคอยื่นไปด้านหน้าระดับเล็กน้อย";
  } else if (cva >= 43 && cva < 47) {
    return " ค่า CVA จัดว่าเป็นผู้ที่มีคอยื่นไปด้านหน้าระดับปานกลาง";
  } else if (cva >= 32 && cva < 43) {
    return "ค่า CVA จัดว่าเป็นผู้ที่มีคอยื่นไปด้านหน้ามาก";
  } else {
    return "โปรดตรวจสอบอีกครั้ง";
  }
}

String getCvaDetail(double cva) {
  if (cva >= 47 && cva <= 50) {
    return "ควรออกกำลังกายยืดเหยียดกล้ามเนื้อและเพิ่มความแข็งแรงของกล้ามเนื้อคอเพื่อปรับท่าทางให้เกิดความสมดุลและป้องกันไม่ให้คอยื่นมากขึ้น";
  } else if (cva >= 43 && cva < 47) {
    return "ควรออกกำลังกายยืดเหยียดกล้ามเนื้อและเพิ่มความแข็งแรงของกล้ามเนื้อคอเพื่อปรับท่าทางให้เกิดความสมดุลและป้องกันไม่ให้คอยื่นมากขึ้น";
  } else if (cva >= 32 && cva < 43) {
    return "ควรออกกำลังกายยืดเหยียดกล้ามเนื้อและเพิ่มความแข็งแรงของกล้ามเนื้อคอเพื่อปรับท่าทางให้เกิดความสมดุลและป้องกันไม่ให้คอยื่นมากขึ้น";
  } else {
    return "โปรดตรวจสอบอีกครั้ง";
  }
}

String getFspMessage(double fsp) {
  if (fsp < 52) {
    return "ค่า FSA จัดว่าเป็นผู้ที่มีไหล่งุ้ม";
  } else {
    return "ค่า FSA จัดว่าปกติดี";
  }
}

String getFspDetail(double fsp) {
  if (fsp < 52 ) {
    return "คนไข้มีอาการศีรษะโค้งไปข้างหน้า";
  }  else {
    return "จัดว่าปกติดี";
  }
}
